<div class="snow">
    <label><b class="b">28.08.21</b> Почав вести список оновлень. Повністю полагодив додавання нового професора, створення звітів, додав можливість видалення, стовпчики "Про Професора" і "Кадровість" тепер відображаються.</label></br>
    <label><b class="b">31.08.21</b> Погрався з дизайном. Додав кнопку "Вхід" і створив модальне вікно для неї.</label></br>
    <label><b class="b">02.09.21</b> Повністю (або майже повністю) реалізував реєстрацію і авторизацію, почав підготовку до створення користувацького функціоналу. Реалізував пошук за іменем, фільтрація за кадровістю.</label></br>
    <label><b class="b">04.09.21</b> Розпочав асиміляцію коду до hmvc. Виправив багато багів у вікнах австоризації/реєстрації та вдосконалив ці вікна, реалізував відновлення паролю через пошту. А також виправив інші баги, що виникали у менш важливих випадках та місцях.</label></br>
    <label><b class="b">07.09.21</b> Додав сесії (створення та вихід з сесії). Виправив деякі баги. МОДАЛЬНІ ВІКНА ПЕРЕСТАЛИ ПРАЦЮВАТИ!( Адаптував код до цієї проблеми на період поки рішення не буде знайдено.</label></br>
    <label><b class="b">08.09.21</b> Модальні вікна полагоджені і модифіковані. Тепер користувачі поділені на адмінів і візиторів. Тільки адміни можуть видаляти і додавати нових професорів. Інші можуть тільки переглядати.</label></br>
    <label><b class="b">10.09.21</b> Покращив дизайн кнопки видалення та вдосконалив табличку з професорами. </label></br>
    <label><b class="b">11.09.21</b> Зробив 3 вкладки: Головна, Професори та Дисципліни. Повністю створив основний функціонал нових вкладок. Почав програмувати створення зв'язків між професорами і дисциплінами. Додав можливість множинної вибірки і множинне видалення для адміністраторів.</label></br>
    <label><b class="b">17.09.21</b> Провів успішну міграцію коду і бази даних з хосту. Виправив баги. Успішна реалізація додавання професору дисципліни яку він веде. </label></br>
    <label><b class="b">20.09.21</b> Тепер натискаючи на спеціальну кнопку у рядку професора (кнопка доступна усім) користувач може переглянути більш детальну інформацію про професора (зокрема його дисципліни). Відповідно, коли це стало доступно, у табличці стало не так тісно. </label></br>
    <label><b class="b">21.09.21</b> Перемістив кнопку додавання дисципліни у модальне вікно. Виправив безліч багів. Зробив перевірку чи є вже така дисципліна в професора.</label></br>
    <label><b class="b">29.09.21</b> Додав функцію додавання фото професора. </label></br>
    <label><b class="b">12.05.22</b> Змінив базу данних з MySQL на SQLite. </label></br>
    <label><b class="b">00.00.00</b> - </label></br>
</div>